Repository: CryptoFR/traduction
Catalog: MW-traduction-*.xlf
Languages: fr

source: A. In fact, this means: maybe someone claims that some unspent output was spent in the old days. But this is impossible, otherwise the sum of the combined transaction could not be zero.
fr: R. En fait, cela signifie: que peut-être quelqu'un prétend qu'une partie de la production non dépensée a été dépensée autrefois. Mais c'est impossible, sinon la somme de la transaction combinée ne pourrait pas être nulle.

source: An exception is that if the outputs are amount zero, it is possible to make two that are negatives of each other, and the pair can be revived without anything breaks. So to prevent consensus problems, outputs 0-amount should be banned. Just add H at each output, now they all amount to at least 1.
fr: Une exception est que si les sorties sont égales à zéro, il est possible d’en faire deux négatives, et la paire peut être ravivée sans aucune interruption. Donc, pour éviter les problèmes de consensus, les sorties du montant 0 devraient être interdites. Il suffit d’ajouter H à chaque sortie, elles représentent toutes au moins 1.

source: Future Research
fr: Recherche future

source: Here are some questions I can not answer at the time of this writing.
fr: Voici quelques questions auxquelles je ne peux pas répondre au moment d'écrire ces lignes.

source: 1. What script support is possible? We would need to translate script operations into some sort of discrete logarithm information.
fr: 1. Quel support de script est possible? Nous aurions besoin de traduire les opérations de script en une sorte d'information logarithmique discrète.

source: 2. We require user to check all k*G values, when in fact all that is needed is that their sum is of the form k*G. Instead of using signatures is there another proof of discrete logarithm that could be combined?
fr: 2. Nous demandons à l'utilisateur de vérifier toutes les valeurs k * G, alors qu'en fait, il suffit que leur somme soit de la forme k * G. Au lieu d'utiliser des signatures, existe-t-il une autre preuve de logarithme discret qui pourrait être combinée?

source: 3. There is a denial-of-service option when a user downloads the chain, the peer can give gigabytes of data and list the wrong unspent outputs. The user will see that the result do not add up to 0, but cannot tell where the problem is.
fr: 3. Il existe une option de déni de service lorsqu'un utilisateur télécharge la chaîne. L'homologue peut donner des giga-octets de données et répertorier les mauvais résultats non dépensés. L'utilisateur verra que le résultat ne correspond pas à 0, mais ne pourra pas dire où se trouve le problème.

source: For now maybe the user should just download the blockchain from a Torrent or something where the data is shared between many users and is reasonably likely to be correct.
fr: Pour l'instant, l'utilisateur devrait peut-être simplement télécharger la blockchain depuis un Torrent ou quelque chose où les données sont partagées par de nombreux utilisateurs et sont raisonnablement susceptibles d'être correctes.
