Repository: CryptoFR/traduction
Catalog: MW-traduction-*.xlf
Languages: fr

source: 19 July, 2016
fr: 19 Juillet, 2016

source: Bitcoin is the first widely used financial system for which all the necessary data to validate the system status can be cryptographically verified by anyone.
fr: Bitcoin est le premier système financier utilisé à grande échelle pour lequel toutes les données nécessaires à la validation de l’état du système peuvent être vérifiées de façon cryptographique par n’importe qui.

source: However, it accomplishes this feat by storing all transactions in a public database called "the blockchain" and someone who genuinely wishes to check this state must download the whole thing and basically replay each transaction,check each one as they go. Meanwhile, most of these transactions have not affected the actual final state (they create outputs that are destroyed a transaction later).
fr: Cependant, cette propriété est accomplie en stockant toutes les transactions dans une base de données publique appelée "la blockchain" et quiconque souhaite véritablement vérifier cet état doit télécharger tout le processus, puis rejouer chaque transaction et les vérifier une à une. Pendant ce temps, la plupart de ces transactions n'ont pas affecté l'état final réel (elles créent des sorties qui sont détruites à la prochaine transaction).

source: At the time of this writing, there were nearly 150 million transactions committed in the blockchain, which must be replayed to produce a set of only 4 million unspent outputs.
fr: Au moment d'écrire ces lignes, près de 150 millions de transactions ont été inscrites dans la blockchain, lesquelles doivent être rejouées pour produire un ensemble de seulement 4 millions de sorties non dépensées.

source: It would be better if an auditor needed only to check data on the outputs themselves, but this is impossible because they are valid if and only if the output is at the end of a chain of previous outputs, each signs the next. In other words, the whole blockchain must be validated to confirm the final state.
fr: Il serait preférable si un auditeur devait seulement vérifier les données sur les sorties elles-mêmes, mais cela est impossible car elles sont valides si et seulement si la sortie est à la fin d'une chaîne de sorties précédentes, chacune signe la suivante. En d'autres termes, toute la blockchain doit être validée pour confirmer l'état final.

source: Add to this that these transactions are cryptographically atomic, it is clear what outputs go into every transaction and what emerges. The "transaction graph" resulting reveals a lot of information and is subjected to analysis by many companies whose business model is to monitor and control the lower classes. This makes it very non-private and even dangerous for people to use.
fr: Ajoutez à cela que ces transactions sont atomique cryptographiquement, il est clair que les sorties vont dans chaque transaction et ce qui en ressort. Le "graphe de transaction" qui en résulte révèle beaucoup d'informations et est soumis à l'analyse de nombreuses entreprises dont le modèle économique consiste à surveiller et contrôler les classes inférieures. Cela le rend publique et dangereux pour les utilisateurs.

source: Some solutions to this have been proposed. Greg Maxwell discovered to encrypt the amounts, so that the graph of the transaction is faceless but still allow validation that the sums are correct [1]. Dr Maxwell also produced CoinJoin, a system for Bitcoin users to combine interactively transactions, confusing the transaction graph. Nicolas van Saberhagen has developed a system to blind the transaction entries, goes much further to cloud the transaction graph (as well as not needed the user interaction)[3]. Later, Shen Noether combined the two approaches to obtain "confidential transactions" of Maxwell AND the darkening of van Saberhagen [4].
fr: Certaines solutions à ce problème ont été proposées. Greg Maxwell a découvert qu'il fallait chiffrer les montants pour que le graphe de transaction soit anonyme, tout en permettant de confirmer que les sommes sont correctes [1]. M. Maxwell a également mis au point CoinJoin, un système permettant aux utilisateurs de Bitcoin de combiner de manière interactive des transactions, ce qui permet de confondre le graphe de transaction. Nicolas van Saberhagen a mis au point un système pour masquer les entrées de transaction, en allant beaucoup plus loin dans le nuage du graphe de transaction (sans avoir besoin de l'interaction utilisateur) [3]. Plus tard, Shen Noether a combiné les deux approches pour obtenir des "transactions confidentielles" de Maxwell ET l'obscurcissement de van Saberhagen [4].

source: These solutions are very good and would make Bitcoin very safe to use. But the problem of too much data is made even worse. Confidential transactions require multi-kilobyte proofs on every output, and van Saberhagen signatures require every output to be stored for ever, since it is not possible to tell when they are truly spent.
fr: Ces solutions sont très bonnes et rendraient Bitcoin très sûr à utiliser. Mais le problème est que le nombre de données stockées est encore plus important. Les transactions confidentielles nécessitent des preuves de plusieurs kilo-octets sur chaque sortie, et les signatures de Van Saberhagen exigent que chaque sortie soit stockée à tout jamais, puisqu' il est impossible de dire quand elles sont réellement dépensées.

source: Dr. Maxwell's CoinJoin has the problem of needing interactivity. Dr. Yuan Horas Mouton fixed this by making transactions freely mergeable [5], but he needed to use pairing-based cryptography, which is potentially slower and more difficult to trust. He called this "one-way aggregate signatures"(OWAS).
fr: CoinJoin du Dr. Maxwell's a le problème du besoin d'interactivité. Le Dr. Yuan Horas Mouton a corrigé ce problème en rendant les transactions librement fusionnables [5], mais il devait utiliser une cryptographie basée sur le couplage, qui est potentiellement plus lente et dans laquelle il est plus difficile d'avoir confiance. Il a appelé cela "signatures à sens unique" (OWAS).

source: OWAS had the good idea to combine the transactions in blocks. Imagine that we can combine across blocks (perhaps with some glue data) so that when the outputs are created and destroyed, it is the same as if they never existed. Then, to validate the entire chain, users only need to know when money is entered into the system (new money in each block as in Bitcoin or Monero or peg-ins for sidechains [6]) and final unspent outputs, the rest can be removed and forgotten. Then we can have Confidential Transactions to hide the amounts and OWAS to blur the transaction graph, and use LESS space than Bitcoin to allow users to fully verify the blockchain. And also imagine that we must not pairing-based cryptography or new hypotheses, just regular discrete logarithms signatures like Bitcoin. Here is what I propose.
fr: OWAS a eu la bonne idée de combiner les transactions en blocs. Imaginons que nous puissions combiner plusieurs blocs (peut-être avec quelques données ajoutée) de sorte que, lorsque les sorties sont créées et détruites, ce soit comme si elles n'avaient jamais existé. Ensuite, pour valider l’ensemble de la chaîne, les utilisateurs doivent seulement savoir quand de l’argent est entré dans le système (nouvel argent dans chaque bloc, comme dans Bitcoin ou Monero, ou peg-ins pour les sidechains [6]) et les sorties finales non dépensées, le reste pouvant être enlevé et oublié. Ensuite, nous pouvons avoir des transactions confidentielles pour masquer les montants et OWAS pour brouiller le graphe de transaction, et utiliser MOINS d'espace que Bitcoin pour permettre aux utilisateurs de vérifier pleinement la blockchain. Et imaginez également que nous ne devons pas utiliser une cryptographie à base de couplages ou de nouvelles hypothèses, mais simplement des signatures logarithmiques discrètes régulières telles que Bitcoin. Voici ce que je propose.

source: I call my creation Mimblewimble because it is used to prevent the blockchain from talking about all user's information [7].
fr: J'appelle ma création Mimblewimble car elle est utilisée pour empêcher la blockchain de parler de toutes informations à propos de l'utilisateur [7].

source: Confidential Transactions and OWAS
fr: Transactions confidentielles et OWAS

source: The first thing we need to do is remove Bitcoin Script. This is sad, but it is too powerful so it is impossible to merge transactions using general scripts. We will demonstrate that confidential transactions of Dr. Maxwell are enough (after some small modification) to authorize spending of outputs and also allows to make combined transactions without interaction. This is in fact identical to OWAS,and allows relaying nodes take some transaction fee or the recipient to change the transaction fees. These additional things Bitcoin can not do, we get for free.
fr: La première chose à faire est de supprimer Bitcoin Script. C'est triste, mais trop puissant, il est donc impossible de fusionner des transactions à l'aide des scripts généraux. Nous démontrerons que les transactions confidentielles de M. Maxwell sont suffisantes (après quelques modifications mineures) pour autoriser les dépenses de sortie et permettent également de réaliser des transactions combinées sans interaction. Ceci est en fait identique à OWAS et permet aux nœuds de relais de prendre certains frais de transaction ou au destinataire de modifier les frais de transaction. Ces choses supplémentaires que Bitcoin ne peut pas faire, nous les obtenons gratuitement.

source: We start by reminding the reader how confidential transactions work. First, the amounts are coded by the following equation:
fr: Nous commençons par rappeler au lecteur le fonctionnement des transactions confidentielles. Tout d'abord, les montants sont codés par l'équation suivante:

source: where C is a Pedersen commitment, G and H are fixed nothing-up-my-sleeve elliptic curve group generators, v is the amount, and r is a secret random blinding key.
fr: ou C est une mise en gage de Pedersen, G et H sont des nothing-up-my-sleeve generateur de courbe elliptique, v est le montant, et r est un secret aléatoire

source: To validate a transaction, the verifer will add commitments for all outputs, plus f*H (f here is the transaction fee which is given explicitly) and subtracts all input commitments. The result must be 0, which proves that no amount was created or destroyed overall.
fr: Pour valider une transaction, le vérificateur ajoutera des engagements pour toutes les sorties, plus f * H (f, ici sont les les frais de transaction qui sont donnés explicitement) et soustrait tous les engagements de saisie. Le résultat doit être 0, ce qui prouve qu'aucun montant n'a été créé ou détruit dans son ensemble.

source: We note that to create such a transaction, the user must know the sum of all the values of r for commitments entries. Therefore, the r-values (and their sums) act as secret keys. If we can make the r output values known only to the recipient, then we have an authentication system! Unfortunately, if we keep the rule that commits all add to 0, this is impossible, because the sender knows the sum of all _his_ r values, and therefore knows the receipient's r values sum to the negative of that. So instead, we allow the transaction to sum to a nonzero value k*G, and require a signature of an empty string with this as key, to prove its amount component is zero.
fr: Nous notons que pour créer une telle transaction, l'utilisateur doit connaître la somme de toutes les valeurs de r pour les entrées d'engagements. Par conséquent, les valeurs-r (et leurs sommes) agissent comme des clés secrètes. Si nous pouvons faire en sorte que les valeurs de sortie ne soient connues que du destinataire, nous avons un système d'authentification! Malheureusement, si nous conservons la règle qui valide tout ajouter à 0, cela est impossible, car l'expéditeur connaît la somme de toutes_les_r valeurs et, par conséquent, la valeur de r du destinataire est négative. Donc, au lieu de cela, nous permettons à la transaction de totaliser une valeur non nulle k * G et demande la signature d'une chaîne vide avec la clé correspondante, afin de prouver que la composante du montant est égale à zéro.

source: We let transactions have as many k*G values as they want, each with a signature, and sum them during verification.
fr: Nous laissons les transactions avoir autant de valeurs k * G qu’elles veulent, chacune avec une signature, et les additionner lors de la vérification.

source: To create transactions sender and recipient do following ritual:
fr: Pour créer des transactions, l'expéditeur et le destinataire effectuent les rituels suivants:

source: 1. Sender and recipient agree on amount to be sent. Call this b.
fr: 1. L'expéditeur et le destinataire conviennent du montant à envoyer. Appel ça b.

source: 2. Sender creates transaction with all inputs and change output(s), and gives
fr: 2. L’expéditeur crée une transaction avec toutes les entrées et modifie les sorties, et donne

source: recipient the total blinding factor (r-value of change minus r-values of
fr: au destinataire le facteur de masquage total (valeur r de la modification moins les valeurs r des

source: inputs) along with this transaction. So the commitments sum to r*G - b*H.
fr: entrées) avec cette transaction. Les engagements s’élèvent donc à r * G - b * H.

source: 3. Recipient chooses random r-values for his outputs, and values that sum
fr: 3. Le destinataire choisit des valeurs r aléatoires pour ses sorties, ainsi que des valeurs dont la somme est égale

source: to b minus fee, and adds these to transaction (including range proof).
fr: à b moins les frais, et les ajoute à la transaction (y compris la preuve de portée).

source: Now the commitments sum to k*G - fee*H for some k that only recipient
fr: Maintenant, les engagements s'élèvent à k * G - frais * H pour certains k qui ne sont que des destinataires

source: knows.
fr: connus

source: 4. Recipient attaches signature with k to the transaction, and the explicit
fr: 4. Le destinataire joint la signature avec k à la transaction et les frais explicites. Il a fait.

source: Now, creating transactions in this manner supports OWAS already. To show this, suppose we have two transactions that have a surplus k1*G and k2*G, and the attached signatures with these. Then you can combine the lists of inputs and outputs of the two transactions, with both k1*G and k2*G to the mix, and voilá! is again a valid transaction. From the combination, it is impossible to say which outputs or inputs are from which original transaction.
fr: Désormais, la création de transactions de cette manière prend déjà en charge OWAS. Pour montrer cela, supposons que nous ayons deux transactions qui ont un surplus k1 * G et k2 * G, ainsi que les signatures attachées à celles-ci. Ensuite, vous pouvez combiner les listes d’entrées et de sorties des deux transactions, avec k1 * G et k2 * G dans le mix, et voilá! est à nouveau une transaction valide. À partir de la combinaison, il est impossible de dire quelles sorties ou quelles entrées proviennent de quelle transaction initiale.

source: Because of this, we change our block format from Bitcoin to this information:
fr: Pour cette raison, nous modifions notre format de bloc de Bitcoin à cette information:

source: 2. Inputs of all transactions
fr: 2. Entrées de toutes les transactions

source: 3. Outputs of all transactions
fr: 3. Résultats de toutes les transactions

source: 4. Excess k*G values for all transactions
fr: 4. Valeurs k * G en excès pour toutes les transactions

source: Each of these are grouped together because it do not matter what the transaction boundaries are originally. In addition, Lists 2 3 and 4 should be required to be coded in alphabetical order, since it is quick to check and prevents the block creator of leaking any information about the original transactions.
fr: Chacune de celles-ci sont regroupées parce que les limites de la transaction importent peu. En outre, les listes 2, 3 et 4 devraient être codées par ordre alphabétique, car elles permettent de vérifier rapidement et empêchent le créateur de blocs de divulguer des informations sur les transactions initiales.

source: Note that the outputs are now identified by their hash, and not by their position in a transaction that could easily change. Therefore, it should be banned to have two unspent outputs are equal at the same time, to avoid confusion.
fr: Notez que les sorties sont maintenant identifiées par leur hachage et non par leur position dans une transaction susceptible de changer facilement. Par conséquent, il faudrait interdire que deux sorties non dépensés soient égales en même temps, afin d'éviter toute confusion.

source: Merging Transactions Across Blocks
fr: Fusion de transactions sur plusieurs blocs

source: Now, we have used Dr. Maxwell's Confidential Transactions to create a noninteractive version of Dr. Maxwell's CoinJoin, but we have not seen the last of marvelous Dr. Maxwell! We need another idea, transaction cut through, he described in [8]. Again, we create a noninteractive version of this, and to show how it is used with several blocks.
fr: Maintenant, nous avons utilisé les Transactions confidentielles du Dr. Maxwell pour créer une version non interactive de CoinJoin, mais nous n’avons pas vu le meilleur de ce merveilleux Dr. Maxwell! Nous avons besoin d'une autre idée, transaction coupée, a-t-il décrit dans [8]. Encore une fois, nous en créons une version non interactive, pour montrer comment elle est utilisée avec plusieurs blocs.

source: We can imagine now each block as one large transaction. To validate it, we add all the output commitments together, then subtracts all input commitments, k*G values, and all explicit input amounts times H. We find that we could combine transactions from two blocks, as we combined transactions to form a single block, and the result is again a valid transaction. Except now, some output commitments have an input commitment exactly equal to it, where the first block's output was spent in the second block. We could remove both commitments and still have a valid transaction. In fact, there is not even need to check the rangeproof of the deleted output.
fr: Nous pouvons maintenant imaginer chaque bloc comme une large transaction. Pour le valider, nous additionnons tous les engagements de sortie, puis soustrayons tous les engagements d’entrée, les valeurs k * G et tous les montants d’entrée explicites multipliés par H. Nous trouvons qu’il est possible de combiner des transactions de deux blocs, en combinant des transactions pour former un seul bloque, et le résultat est à nouveau une transaction valide. Sauf que maintenant, certains engagements de résultat ont un engagement d'entré exactement égal à celui-ci, la sortie du premier bloc ayant été dépensée dans le second bloc. Nous pourrions supprimer les deux engagements tout en ayant une transaction valide. En fait, il n'est même pas nécessaire de vérifier la preuve de portée de la sortie supprimée.

source: The extension of this idea all the way from the genesis block to the latest block, we see that EVERY nonexplicit input is deleted along with its referenced output. What remains are only the unspent outputs, explicit input amounts and every k*G value. And this whole mess can be validated as if it were one transaction: add all unspent commitments output, subtract the values k*G, validate explicit input amounts (if there is anything to validate) then subtract them times H. If the sum is 0, the entire chain is good.
fr: L'extension de cette idée depuis le bloc genesis jusqu'au dernier bloc indique que CHAQUE entrée non explicite est supprimée avec sa sortie référencée. Ce qui reste ne sont que les sorties non dépensées, les quantités d'entrée explicites et chaque valeur k * G. Et tout ce bazar peut être validé comme s’il s’agissait d’une transaction: ajoutez tous les engagements non dépensés, soustrayez les valeurs k * G, validez les montants en entrée explicites (s’il ya quelque chose à valider), puis soustrayez-les fois H. Si la somme est égale à 0 , toute la chaîne est bonne.

source: What is this mean? When a user starts up and downloads the chain he needs the following data from each block:
fr: Quel est ce moyen? Lorsqu'un utilisateur démarre et télécharge la chaîne, il a besoin des données suivantes de chaque bloc:

source: whatever else data this needs.
fr: quelles que soient les autres données nécessaires.

source: 2. Unspent outputs of all transactions, along with a merkle proof that each
fr: 2. Les sorties non utilisées de toutes les transactions, accompagnées d’une preuve de merkle que chaque

source: output appeared in the original block.
fr: sortie apparait dans le bloc d'origine.

source: 3. Excess k*G values for all transactions.
fr: 3. Les valeurs k * G en excès pour toutes les transactions.

source: Bitcoin today there are about 423000 blocks, totaling 80GB or so of data on the hard drive to validate everything. These data are about 150 million transactions and 5 million unspent nonconfidential outputs. Estimate how much space the number of transactions take on a Mimblewimble chain. Each unspent output is around 3Kb for rangeproof and Merkle proof. Each transaction also adds about 100 bytes: a k*G value and a signature. The block headers and explicit amounts are negligible. Add this together and get 30Gb -- with a confidential transaction and obscured transaction graph!
fr: Aujourd'hui, il y a environ 423000 blocs sur Bitcoin, totalisant environ 80 Go de données sur le disque dur pour tout valider. Ces données représentent environ 150 millions de transactions et 5 millions de sorties non confidentielles non dépensées. Estimez l'espace occupé par le nombre de transactions sur une chaîne Mimblewimble. Chaque sortie non dépensée est d’environ 3Kb la preuve de portée et la preuve de merkle. Chaque transaction ajoute également environ 100 octets: une valeur k * G et une signature. Les en-têtes de bloc et les montants explicites sont négligeables. Ajoutez ceci ensemble et obtenez 30 Go - avec une transaction confidentielle et un graphique de transaction masqué!

source: Questions and Intuition
fr: Questions et intuition

source: Here are some questions that since these weeks, dreams asked me and I woke up sweating.
fr: Voici quelques questions qui depuis quelques semaines m'empêchaient de dormir tranquillement et me faisaient réveiller en sueur.

source: But in fact it is OK.
fr: Mais en vrai c'est OK.

source: Q. If you delete the transaction outputs, user cannot verify the range proof and maybe
fr: Q. Si vous supprimez les sorties de transaction, l’utilisateur ne peut pas vérifier la preuve de portée et peut-être

source: a negative amount is created.
fr: un montant négatif est créé.

source: A. This is OK. For the entire transaction to validate all negative amounts must have been destroyed. User have SPV security only that no illegal inflation happened in the past, but the user knows that _at this time_ no inflation occurred.
fr: R. C'est OK. Pour que la transaction entière soit validée, tous les montants négatifs doivent avoir été détruits. Les utilisateurs ont la sécurité SPV seulement qu’aucune inflation illégale ne s’est produite dans le passé, mais l’utilisateur sait que, cette fois, aucune inflation ne s’est produite.

source: Q. If you delete the inputs, double spending can happen.
fr: Q. Si vous supprimez les entrées, une double dépense peut arriver.
